tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/services"
tap "localsend/localsend"
brew "aria2"
brew "bat"
brew "entr"
brew "eza"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "git"
brew "lua"
brew "neovim"
brew "pkg-config"
brew "ripgrep"
brew "tree"
brew "yt-dlp"
brew "zoxide"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "exifcleaner"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "karabiner-elements"
cask "keka"
cask "localsend"
cask "logi-options-plus"
cask "maccy"
cask "neardrop"
cask "netnewswire"
cask "obsidian"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "raycast"
cask "rectangle"
cask "signal"
cask "stats"
cask "syntax-highlight"
cask "telegram"
cask "tomatobar"
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "prisma.prisma"
vscode "steoates.autoimport"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
