tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
brew "aria2"
brew "libgit2@1.7"
brew "bat"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "git"
brew "httpie"
brew "node"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "yt-dlp"
brew "zoxide"
brew "mongodb/brew/mongodb-community"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anki"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "maccy"
cask "netnewswire"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rectangle"
cask "stats"
cask "telegram"
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "lokalise.i18n-ally"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "sdras.night-owl"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
